Documents/Д_ЗаявкаНаАвансовыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ЗаявкаНаАвансовыйОтчет</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяЗадача</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийБизнесПроцесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Comment>Корректируется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДСтрокиДокОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезЗаявкиНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратДенежныхСредствБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоПодОтчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Д_ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>350</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвПроект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтрокиЗаявкиНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИДСтрокиДокОснования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Д_ЗаявкаНаАвансовыйОтчет/Forms/ФормаПодбораСтрокЗаявки/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выбрать(Команда)
	МассивУИДов = Новый Массив;
	ОтобранныеСтроки = СтрокиЗаявкиНаОплату.НайтиСтроки(Новый Структура("Выбран", Истина));
	Для каждого ТекСтрока Из ОтобранныеСтроки Цикл
		МассивУИДов.Добавить(Новый Структура("ДокОснование, УИДСтрокиДокОснования",ТекСтрока.Ссылка, ТекСтрока.УИДСтроки));
	КонецЦикла; 
	Оповестить("ВыбраныСтрокиЗаявки", МассивУИДов);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Заявка) = Тип("Массив") Тогда
		МассивЗаявок = Параметры.Заявка;
	ИначеЕсли ТипЗнч(Параметры.Заявка) = Тип("СписокЗначений") Тогда
		МассивЗаявок = Параметры.Заявка.ВыгрузитьЗначения();
	Иначе
		МассивЗаявок = новый Массив;
		МассивЗаявок.Добавить(Параметры.Заявка);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.НомерСтроки,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.СтатьяДДС,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.СуммаДДС,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.Контрагент,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.НазначениеПлатежа,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.ЦФО,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.Источник,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.Подразделение,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.УИДСтроки,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.ВыдачаВПодОтчет,
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.Ссылка
	|ИЗ
	|	Документ.Д_ЗаявкаНаОплату.ЗаявкаБезнал КАК Д_ЗаявкаНаОплатуЗаявкаБезнал
	|ГДЕ
	|	Д_ЗаявкаНаОплатуЗаявкаБезнал.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивЗаявок);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтрокиЗаявкиНаОплату.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если НЕ Параметры.УИДЫ.Найти(Выборка.УИДСтроки) = Неопределено Тогда
			НоваяСтрока.Выбран = Истина;	
		КонецЕсли;
		
		Если НЕ СписокЗаявок.НайтиСтроки(Новый Структура("ДокОснование", Выборка.Ссылка)).Количество() Тогда
			НоваяСтрока = СписокЗаявок.Добавить();
			НоваяСтрока.ДокОснование = Выборка.Ссылка;	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьКоличествоСтрок();
	
	Если МассивЗаявок.Количество() < 2 Тогда
		Элементы.СписокЗаявок.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоСтрок()
	Для каждого ТекСтрока Из СписокЗаявок Цикл
		ОтобранныеСтроки = СтрокиЗаявкиНаОплату.НайтиСтроки(Новый Структура("Ссылка, Выбран", ТекСтрока.ДокОснование, Истина));
		ТекСтрока.КоличествоСтрок = ОтобранныеСтроки.Количество();
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СтрокиЗаявкиНаОплатуВыбранПриИзменении(Элемент)
	ЗаполнитьКоличествоСтрок();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.СписокЗаявок.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Элементы.СтрокиЗаявкиНаОплату.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Ссылка", ТекДанные.ДокОснование));
	Иначе
		Элементы.СтрокиЗаявкиНаОплату.ОтборСтрок = Неопределено;	
	КонецЕсли;
КонецПроцедуры
